"""
Очень часто веб-дизайнеры используют HEX-значение какого-либо цвета.
Напишите программу принимающую 2 позиционных аргумента: слово "Цвета" и количество цветов.
и произвольное количество значений Цвет : HEX. Программа должна вывести все данные на экран.
"""
def get_hex():
    pass


def main():
    colors = input().split()
    print(get_hex(colors))
    pass


if __name__ == "__main__":
    pass